#+TODO:TODO(t@) WORKING(w!) IDEA(i@) | DONE(d@) REJECTED(r@)
#+TODO:REPORT(r@) BUG(b@) KNOWNCAUSE(k@) | FIXED(f@)
#+ARCHIVE: ::* Archived

* TODO Сделать вкладку со сделками
  - State "TODO"       from ""           [2011-03-11 Птн 12:45] \\
    вкладка с деревом сделок в котором отображаются все данные по сделкам
    введенным в базу. Вложенность в дереве сделок определяется уровнем
    расписанности сделки. Кнопка с хоткеем для быстрого ручного добавления
    сделок, в том числе парных. Возможность удаления сделок. Фильтр по
    дате, бумаге, количеству, цене, направлению сделки, а также по статусу
    сделки, возможность перехода к позиции, которой сделка принадлежит.

* TODO Сделать вкладке с позициями
  - State "TODO"       from ""           [2011-03-11 Птн 12:51] \\
    Вкладка с позициями. Возможность разбития отдельных позиций и всех
    сразу. Возможность ручного комбинирования сделок в позиции (скорее
    всего это во вкладке со сделками лучше сделать). Фильтр для сделок по
    бумаге, лось / профит, длинная / короткая, количество цена открытия
    цена закрытия, дата.

* TODO Переделать вкладку с отчетом
  - State "TODO"       from ""           [2011-03-11 Птн 16:25] \\
    Сделать генерацию отчета одной кнопкой по которой будет всплывать
    диалог с датой начала, датой конца, списком чекбоксов для выбора
    списка акций, количеством профита, лося

* TODO Для фьючей переделать импортер
  CLOCK: [2011-03-11 Птн 16:44]--[2011-03-11 Птн 17:24] =>  0:40
  CLOCK: [2011-03-11 Птн 16:29]--[2011-03-11 Птн 16:38] =>  0:09
  - State "TODO"       from ""           [2011-03-11 Птн 16:27] \\
    для фьючей из отчета вытаскивать сууму комиссий за период и равномерно
    распределять ее по сделкам за этот период.

* TODO Заставить тесты снова работать
  - Note taken on [2011-03-11 Птн 23:34] \\
    ошибка возникает когда пытаешся разбить сделку на сделки с равным
    quantity в этом случае нарушается уникальность сделки по составному ключу
  CLOCK: [2011-03-11 Птн 23:15]
  CLOCK: [2011-03-11 Птн 17:25]--[2011-03-11 Птн 17:31] =>  0:06
  - State "TODO"       from ""           [2011-03-11 Птн 17:25] \\
    Это после исправления опечаток с констрейнами. так как констрейны
    теперь соблюдаются правильно надо переписать разбивалку сделок так как
    она пытается создать не уникальные записи
